[Killed] BlockStatement
controllers/userController.js:11:30
 const { EmailVerificationTemplate, ResetPasswordTemplate } = require('../templates/templates.js');
 require('dotenv').config();
 
-const errorHandle = (err) => {
-    return err.message || 'An unknown error occurred';
-};
+const errorHandle = (err) => {};
 
 function isDomainValid(email) {
killedBy: Auth Controller errorHandle should return default message when error message is empty
statusReason: expected undefined to equal 'An unknown error occurred'

[Killed] ConditionalExpression
controllers/userController.js:12:12
 require('dotenv').config();
 
 const errorHandle = (err) => {
-    return err.message || 'An unknown error occurred';
+    return true;
 };
 
killedBy: Auth Controller errorHandle should return default message when error message is empty
statusReason: expected true to equal 'An unknown error occurred'

[Killed] ConditionalExpression
controllers/userController.js:12:12
 require('dotenv').config();
 
 const errorHandle = (err) => {
-    return err.message || 'An unknown error occurred';
+    return false;
 };
 
killedBy: Auth Controller errorHandle should return default message when error message is empty
statusReason: expected false to equal 'An unknown error occurred'

[Killed] BlockStatement
controllers/userController.js:15:31
     return err.message || 'An unknown error occurred';
 };
 
-function isDomainValid(email) {
-    return new Promise((resolve) => {
-        const domain = email.split('@')[1];
-        dns.resolveMx(domain, (error, addresses) => {
-            if (error || !addresses || addresses.length === 0) {
-                resolve(false);  // No valid MX record
-            } else {
-                resolve(true);  // Valid MX record found
-            }
-        });
-    });
-}
+function isDomainValid(email) {}
 
 const signup_post = async (req, res) => {
killedBy: Auth Controller signup_post should return 401 if passwords do not match
statusReason: expected false to be true

[Timeout] BlockStatement
controllers/userController.js:16:37
 };
 
 function isDomainValid(email) {
-    return new Promise((resolve) => {
-        const domain = email.split('@')[1];
-        dns.resolveMx(domain, (error, addresses) => {
-            if (error || !addresses || addresses.length === 0) {
-                resolve(false);  // No valid MX record
-            } else {
-                resolve(true);  // Valid MX record found
-            }
-        });
-    });
+    return new Promise((resolve) => {});
 }
 

[Killed] StringLiteral
controllers/userController.js:17:36
 
 function isDomainValid(email) {
     return new Promise((resolve) => {
-        const domain = email.split('@')[1];
+        const domain = email.split("")[1];
         dns.resolveMx(domain, (error, addresses) => {
             if (error || !addresses || addresses.length === 0) {
killedBy: Auth Controller signup_post should handle error when saving user fails
statusReason: expected 'Invalid email domain' to equal 'Database error'

[Timeout] BlockStatement
controllers/userController.js:18:53
 function isDomainValid(email) {
     return new Promise((resolve) => {
         const domain = email.split('@')[1];
-        dns.resolveMx(domain, (error, addresses) => {
-            if (error || !addresses || addresses.length === 0) {
-                resolve(false);  // No valid MX record
-            } else {
-                resolve(true);  // Valid MX record found
-            }
-        });
+        dns.resolveMx(domain, (error, addresses) => {});
     });
 }

[Killed] ConditionalExpression
controllers/userController.js:19:40
     return new Promise((resolve) => {
         const domain = email.split('@')[1];
         dns.resolveMx(domain, (error, addresses) => {
-            if (error || !addresses || addresses.length === 0) {
+            if (error || !addresses || false) {
                 resolve(false);  // No valid MX record
             } else {
killedBy: Auth Controller signup_post should return 400 for an invalid email domain
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:19:17
     return new Promise((resolve) => {
         const domain = email.split('@')[1];
         dns.resolveMx(domain, (error, addresses) => {
-            if (error || !addresses || addresses.length === 0) {
+            if (true) {
                 resolve(false);  // No valid MX record
             } else {
killedBy: Auth Controller signup_post should return 401 if passwords do not match
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/userController.js:20:25
         const domain = email.split('@')[1];
         dns.resolveMx(domain, (error, addresses) => {
             if (error || !addresses || addresses.length === 0) {
-                resolve(false);  // No valid MX record
+                resolve(true);  // No valid MX record
             } else {
                 resolve(true);  // Valid MX record found
killedBy: Auth Controller signup_post should return 400 for an invalid email domain
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:21:20
         dns.resolveMx(domain, (error, addresses) => {
             if (error || !addresses || addresses.length === 0) {
                 resolve(false);  // No valid MX record
-            } else {
-                resolve(true);  // Valid MX record found
-            }
+            } else {}
         });
     });
killedBy: Auth Controller signup_post should return 401 if passwords do not match
statusReason: Timeout of 5000ms exceeded. For async tests and hooks, ensure "done()" is called; if returning a Promise, ensure it resolves. (C:\Users\Rittr\Desktop\DAIICT\Sem 5\Software Engineering\Final\Backend\.stryker-tmp\sandbox6056127\test\userController_test.js)

[Killed] BooleanLiteral
controllers/userController.js:22:25
             if (error || !addresses || addresses.length === 0) {
                 resolve(false);  // No valid MX record
             } else {
-                resolve(true);  // Valid MX record found
+                resolve(false);  // Valid MX record found
             }
         });
killedBy: Auth Controller signup_post should return 401 if passwords do not match
statusReason: expected false to be true

[Timeout] BlockStatement
controllers/userController.js:33:19
         const { name, email, password, confirmPassword, isOwner } = req.body;
         const user = await usermodel.findOne({ email: email });
     
-        if (user) {
-            return res.status(409).json({ message: "User already exists" })
-        }
+        if (user) {}
         // Validate email domain
         const domainValid = await isDomainValid(email);

[Killed] BlockStatement
controllers/userController.js:38:27
         }
         // Validate email domain
         const domainValid = await isDomainValid(email);
-        if (!domainValid) {
-            return res.status(400).json({ message: "Invalid email domain" });
-        }
+        if (!domainValid) {}
         if (password !== confirmPassword) {
             return res.status(401).json({ message: "Password not matching" })
killedBy: Auth Controller signup_post should return 400 for an invalid email domain
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:38:13
         }
         // Validate email domain
         const domainValid = await isDomainValid(email);
-        if (!domainValid) {
+        if (true) {
             return res.status(400).json({ message: "Invalid email domain" });
         }
killedBy: Auth Controller signup_post should return 401 if passwords do not match
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:41:13
         if (!domainValid) {
             return res.status(400).json({ message: "Invalid email domain" });
         }
-        if (password !== confirmPassword) {
+        if (false) {
             return res.status(401).json({ message: "Password not matching" })
         }
killedBy: Auth Controller signup_post should return 401 if passwords do not match
statusReason: Timeout of 5000ms exceeded. For async tests and hooks, ensure "done()" is called; if returning a Promise, ensure it resolves. (C:\Users\Rittr\Desktop\DAIICT\Sem 5\Software Engineering\Final\Backend\.stryker-tmp\sandbox6056127\test\userController_test.js)

[Killed] ConditionalExpression
controllers/userController.js:41:13
         if (!domainValid) {
             return res.status(400).json({ message: "Invalid email domain" });
         }
-        if (password !== confirmPassword) {
+        if (true) {
             return res.status(401).json({ message: "Password not matching" })
         }
killedBy: Auth Controller signup_post should handle error when saving user fails
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:63:21
 
         res.status(200).json({ message: "User created successfully", userId: newUser._id, owner: newUser.isOwner })
 
-    } catch (error) {
-        console.log(error.message);
-        res.status(400).json({ message: error.message });
-    }
+    } catch (error) {}
 
 }
killedBy: Auth Controller signup_post should handle error when saving user fails
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/userController.js:65:30
 
     } catch (error) {
         console.log(error.message);
-        res.status(400).json({ message: error.message });
+        res.status(400).json({});
     }
 
killedBy: Auth Controller signup_post should handle error when saving user fails
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:70:61
 
 }
 
-const sendConfirmationEmail = async (name, email, token) => {
-    try {
-        const transporter = nodemailer.createTransport({
-            host: 'smtp.gmail.com',
-            port: 465,
-            secure: true,
-            auth: {
-                user: process.env.email,
-                pass: process.env.password
-            }
-        });
-        console.log(process.env.BACKEND_URL);
-        const mailOptions = {
-            from: process.env.email,
-            to: email,
-            subject: 'Account Confirmation',
-            html: EmailVerificationTemplate.replace("{Username}",name).replace("{url}",`${process.env.BACKEND_URL}/auth/confirm-email/${token}`)
-        };
-        
-        await transporter.sendMail(mailOptions);
-        console.log(`Confirmation email sent to ${email}`);
-    } catch (error) {
-        console.log(error);
-    }
-};
+const sendConfirmationEmail = async (name, email, token) => {};
 
 const confirmEmail = async (req, res) => {
killedBy: Auth Controller signup_post should handle error when sending confirmation email fails
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:71:9
 }
 
 const sendConfirmationEmail = async (name, email, token) => {
-    try {
-        const transporter = nodemailer.createTransport({
-            host: 'smtp.gmail.com',
-            port: 465,
-            secure: true,
-            auth: {
-                user: process.env.email,
-                pass: process.env.password
-            }
-        });
-        console.log(process.env.BACKEND_URL);
-        const mailOptions = {
-            from: process.env.email,
-            to: email,
-            subject: 'Account Confirmation',
-            html: EmailVerificationTemplate.replace("{Username}",name).replace("{url}",`${process.env.BACKEND_URL}/auth/confirm-email/${token}`)
-        };
-        
-        await transporter.sendMail(mailOptions);
-        console.log(`Confirmation email sent to ${email}`);
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
     }
killedBy: Auth Controller signup_post should handle error when sending confirmation email fails
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/userController.js:72:56
 
 const sendConfirmationEmail = async (name, email, token) => {
     try {
-        const transporter = nodemailer.createTransport({
-            host: 'smtp.gmail.com',
-            port: 465,
-            secure: true,
-            auth: {
-                user: process.env.email,
-                pass: process.env.password
-            }
-        });
+        const transporter = nodemailer.createTransport({});
         console.log(process.env.BACKEND_URL);
         const mailOptions = {
killedBy: Auth Controller sendConfirmationEmail should send email with correct options
statusReason: Cannot read properties of null (reading 'args')

[Killed] StringLiteral
controllers/userController.js:73:19
 const sendConfirmationEmail = async (name, email, token) => {
     try {
         const transporter = nodemailer.createTransport({
-            host: 'smtp.gmail.com',
+            host: "",
             port: 465,
             secure: true,
killedBy: Auth Controller sendConfirmationEmail should send email with correct options
statusReason: Cannot read properties of null (reading 'args')

[Killed] BooleanLiteral
controllers/userController.js:75:21
         const transporter = nodemailer.createTransport({
             host: 'smtp.gmail.com',
             port: 465,
-            secure: true,
+            secure: false,
             auth: {
                 user: process.env.email,
killedBy: Auth Controller sendConfirmationEmail should send email with correct options
statusReason: Cannot read properties of null (reading 'args')

[Killed] StringLiteral
controllers/userController.js:85:22
         const mailOptions = {
             from: process.env.email,
             to: email,
-            subject: 'Account Confirmation',
+            subject: "",
             html: EmailVerificationTemplate.replace("{Username}",name).replace("{url}",`${process.env.BACKEND_URL}/auth/confirm-email/${token}`)
         };
killedBy: Auth Controller sendConfirmationEmail should send email with correct options
statusReason: expected { from: 'maulikk7304@gmail.com', …(3) } to have property 'subject' of 'Account Confirmation', but got ''

[Survived] StringLiteral
controllers/userController.js:90:21
         };
         
         await transporter.sendMail(mailOptions);
-        console.log(`Confirmation email sent to ${email}`);
+        console.log(``);
     } catch (error) {
         console.log(error);

[Killed] BlockStatement
controllers/userController.js:91:21
         
         await transporter.sendMail(mailOptions);
         console.log(`Confirmation email sent to ${email}`);
-    } catch (error) {
-        console.log(error);
-    }
+    } catch (error) {}
 };
 
killedBy: Auth Controller signup_post should handle error when sending confirmation email fails
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:96:42
     }
 };
 
-const confirmEmail = async (req, res) => {
-    try {
-        const token = req.params.token;
-        const decoded = jwt.verify(token, process.env.JWT_SECRET);
-        const sessionToken = randomstring.generate(32);
-        const user = await usermodel.findByIdAndUpdate(
-            decoded._id,
-            { emailVerified: true , sessionToken: sessionToken },
-            { new: true, runValidators: false }
-        );
-
-        if (!user) {
-            return res.status(400).json({ message: "Invalid token or user does not exist" });
-        }
-        const userType = user.isOwner === true ? 'owner' : 'customer';
-        
-        res.redirect(`${process.env.FRONTEND_URL}/login?type=${userType}&verified=true`);
-    } catch (error) {
-        console.log(error.message);
-        res.status(400).json({ message: "Email confirmation failed" });
-    }
-};
+const confirmEmail = async (req, res) => {};
 
 
killedBy: Auth Controller confirmEmail should redirect to login page for valid token
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
controllers/userController.js:97:9
 };
 
 const confirmEmail = async (req, res) => {
-    try {
-        const token = req.params.token;
-        const decoded = jwt.verify(token, process.env.JWT_SECRET);
-        const sessionToken = randomstring.generate(32);
-        const user = await usermodel.findByIdAndUpdate(
-            decoded._id,
-            { emailVerified: true , sessionToken: sessionToken },
-            { new: true, runValidators: false }
-        );
-
-        if (!user) {
-            return res.status(400).json({ message: "Invalid token or user does not exist" });
-        }
-        const userType = user.isOwner === true ? 'owner' : 'customer';
-        
-        res.redirect(`${process.env.FRONTEND_URL}/login?type=${userType}&verified=true`);
-    } catch (error) {
+    try {} catch (error) {
         console.log(error.message);
         res.status(400).json({ message: "Email confirmation failed" });
killedBy: Auth Controller confirmEmail should redirect to login page for valid token
statusReason: Target cannot be null or undefined.

[Killed] BooleanLiteral
controllers/userController.js:103:30
         const sessionToken = randomstring.generate(32);
         const user = await usermodel.findByIdAndUpdate(
             decoded._id,
-            { emailVerified: true , sessionToken: sessionToken },
+            { emailVerified: false , sessionToken: sessionToken },
             { new: true, runValidators: false }
         );
killedBy: Auth Controller confirmEmail should redirect to login page for valid token
statusReason: expected { emailVerified: false, …(1) } to have property 'emailVerified' of true, but got false

[Killed] BooleanLiteral
controllers/userController.js:104:41
         const user = await usermodel.findByIdAndUpdate(
             decoded._id,
             { emailVerified: true , sessionToken: sessionToken },
-            { new: true, runValidators: false }
+            { new: true, runValidators: true }
         );
 
killedBy: Auth Controller confirmEmail should redirect to login page for valid token
statusReason: expected { new: true, runValidators: true } to deeply equal { new: true, runValidators: false }

[Killed] BooleanLiteral
controllers/userController.js:104:20
         const user = await usermodel.findByIdAndUpdate(
             decoded._id,
             { emailVerified: true , sessionToken: sessionToken },
-            { new: true, runValidators: false }
+            { new: false, runValidators: false }
         );
 
killedBy: Auth Controller confirmEmail should redirect to login page for valid token
statusReason: expected { new: false, runValidators: false } to deeply equal { new: true, runValidators: false }

[Killed] BlockStatement
controllers/userController.js:107:20
             { new: true, runValidators: false }
         );
 
-        if (!user) {
-            return res.status(400).json({ message: "Invalid token or user does not exist" });
-        }
+        if (!user) {}
         const userType = user.isOwner === true ? 'owner' : 'customer';
         
killedBy: Auth Controller confirmEmail should handle non-existent user
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/userController.js:108:41
         );
 
         if (!user) {
-            return res.status(400).json({ message: "Invalid token or user does not exist" });
+            return res.status(400).json({});
         }
         const userType = user.isOwner === true ? 'owner' : 'customer';
killedBy: Auth Controller confirmEmail should handle non-existent user
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/userController.js:110:26
         if (!user) {
             return res.status(400).json({ message: "Invalid token or user does not exist" });
         }
-        const userType = user.isOwner === true ? 'owner' : 'customer';
+        const userType = user.isOwner !== true ? 'owner' : 'customer';
         
         res.redirect(`${process.env.FRONTEND_URL}/login?type=${userType}&verified=true`);
killedBy: Auth Controller confirmEmail should redirect to login page for valid token
statusReason: expected 'http://localhost:3000/login?type=cust…' to include '/login?type=owner&verified=true'

[Killed] BooleanLiteral
controllers/userController.js:110:43
         if (!user) {
             return res.status(400).json({ message: "Invalid token or user does not exist" });
         }
-        const userType = user.isOwner === true ? 'owner' : 'customer';
+        const userType = user.isOwner === false ? 'owner' : 'customer';
         
         res.redirect(`${process.env.FRONTEND_URL}/login?type=${userType}&verified=true`);
killedBy: Auth Controller confirmEmail should redirect to login page for valid token
statusReason: expected 'http://localhost:3000/login?type=cust…' to include '/login?type=owner&verified=true'

[Killed] BlockStatement
controllers/userController.js:113:21
         const userType = user.isOwner === true ? 'owner' : 'customer';
         
         res.redirect(`${process.env.FRONTEND_URL}/login?type=${userType}&verified=true`);
-    } catch (error) {
-        console.log(error.message);
-        res.status(400).json({ message: "Email confirmation failed" });
-    }
+    } catch (error) {}
 };
 
killedBy: Auth Controller confirmEmail should handle invalid token
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/userController.js:115:30
         res.redirect(`${process.env.FRONTEND_URL}/login?type=${userType}&verified=true`);
     } catch (error) {
         console.log(error.message);
-        res.status(400).json({ message: "Email confirmation failed" });
+        res.status(400).json({});
     }
 };
killedBy: Auth Controller confirmEmail should handle invalid token
statusReason: expected false to be true

[Killed] StringLiteral
controllers/userController.js:115:41
         res.redirect(`${process.env.FRONTEND_URL}/login?type=${userType}&verified=true`);
     } catch (error) {
         console.log(error.message);
-        res.status(400).json({ message: "Email confirmation failed" });
+        res.status(400).json({ message: "" });
     }
 };
killedBy: Auth Controller confirmEmail should handle invalid token
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:121:9
 
 
 const login_post = async (req, res) => {
-    try {
-        const { email, password, isOwner } = req.body;
-        const data = await usermodel.findOne({ email: email })
-        if (!data) {
-            return res.status(401).json({ message: "Enter Valid Email" });
-        }
-
-        if (data.isOwner != isOwner) {
-            return res.status(401).json({ message: "Invalid User" });
-        }
-        if (!data.emailVerified) {
-            return res.status(403).json({ 
-                message: "Please verify your email before logging in. Check your inbox for the confirmation link." 
-            });
-        }
-        const isMatch = await bcrypt.compare(password, data.password);
-        if (!isMatch) {
-            return res.status(401).json({ message: "Enter valid password" });
-        }
-        const token = jwt.sign({ _id: data._id , isOwner:data.isOwner }, process.env.JWT_SECRET, {
-            expiresIn: "24h"
-        })
-        res.setHeader('Authorization', 'Bearer ' + token);
-        res.status(200).json({ message: "User logged in successfully", userId: data._id, token: token })
-    } catch (error) {
+    try {} catch (error) {
         console.log(error.message);
         res.status(400).json({ message: error.message });
killedBy: Auth Controller login_post should log in the user with valid credentials
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/userController.js:123:46
 const login_post = async (req, res) => {
     try {
         const { email, password, isOwner } = req.body;
-        const data = await usermodel.findOne({ email: email })
+        const data = await usermodel.findOne({})
         if (!data) {
             return res.status(401).json({ message: "Enter Valid Email" });
killedBy: Auth Controller login_post should log in the user with valid credentials
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:124:20
     try {
         const { email, password, isOwner } = req.body;
         const data = await usermodel.findOne({ email: email })
-        if (!data) {
-            return res.status(401).json({ message: "Enter Valid Email" });
-        }
+        if (!data) {}
 
         if (data.isOwner != isOwner) {
killedBy: Auth Controller login_post should return 401 for invalid email
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:124:13
     try {
         const { email, password, isOwner } = req.body;
         const data = await usermodel.findOne({ email: email })
-        if (!data) {
+        if (false) {
             return res.status(401).json({ message: "Enter Valid Email" });
         }
killedBy: Auth Controller login_post should return 401 for invalid email
statusReason: expected false to be true

[Killed] EqualityOperator
controllers/userController.js:128:13
             return res.status(401).json({ message: "Enter Valid Email" });
         }
 
-        if (data.isOwner != isOwner) {
+        if (data.isOwner == isOwner) {
             return res.status(401).json({ message: "Invalid User" });
         }
killedBy: Auth Controller login_post should log in the user with valid credentials
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:128:13
             return res.status(401).json({ message: "Enter Valid Email" });
         }
 
-        if (data.isOwner != isOwner) {
+        if (false) {
             return res.status(401).json({ message: "Invalid User" });
         }
killedBy: Auth Controller login_post should return 401 for mismatched user type
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/userController.js:131:13
         if (data.isOwner != isOwner) {
             return res.status(401).json({ message: "Invalid User" });
         }
-        if (!data.emailVerified) {
+        if (data.emailVerified) {
             return res.status(403).json({ 
                 message: "Please verify your email before logging in. Check your inbox for the confirmation link." 
killedBy: Auth Controller login_post should log in the user with valid credentials
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:131:34
         if (data.isOwner != isOwner) {
             return res.status(401).json({ message: "Invalid User" });
         }
-        if (!data.emailVerified) {
-            return res.status(403).json({ 
-                message: "Please verify your email before logging in. Check your inbox for the confirmation link." 
-            });
-        }
+        if (!data.emailVerified) {}
         const isMatch = await bcrypt.compare(password, data.password);
         if (!isMatch) {
killedBy: Auth Controller login_post should return 403 for unverified email
statusReason: expected false to be true

[Killed] StringLiteral
controllers/userController.js:133:26
         }
         if (!data.emailVerified) {
             return res.status(403).json({ 
-                message: "Please verify your email before logging in. Check your inbox for the confirmation link." 
+                message: "" 
             });
         }
killedBy: Auth Controller login_post should return 403 for unverified email
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/userController.js:137:13
             });
         }
         const isMatch = await bcrypt.compare(password, data.password);
-        if (!isMatch) {
+        if (isMatch) {
             return res.status(401).json({ message: "Enter valid password" });
         }
killedBy: Auth Controller login_post should log in the user with valid credentials
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:137:13
             });
         }
         const isMatch = await bcrypt.compare(password, data.password);
-        if (!isMatch) {
+        if (true) {
             return res.status(401).json({ message: "Enter valid password" });
         }
killedBy: Auth Controller login_post should log in the user with valid credentials
statusReason: expected false to be true

[Killed] StringLiteral
controllers/userController.js:138:52
         }
         const isMatch = await bcrypt.compare(password, data.password);
         if (!isMatch) {
-            return res.status(401).json({ message: "Enter valid password" });
+            return res.status(401).json({ message: "" });
         }
         const token = jwt.sign({ _id: data._id , isOwner:data.isOwner }, process.env.JWT_SECRET, {
killedBy: Auth Controller login_post should return 401 for invalid password
statusReason: expected false to be true

[Survived] StringLiteral
controllers/userController.js:141:24
             return res.status(401).json({ message: "Enter valid password" });
         }
         const token = jwt.sign({ _id: data._id , isOwner:data.isOwner }, process.env.JWT_SECRET, {
-            expiresIn: "24h"
+            expiresIn: ""
         })
         res.setHeader('Authorization', 'Bearer ' + token);

[Killed] ObjectLiteral
controllers/userController.js:144:30
             expiresIn: "24h"
         })
         res.setHeader('Authorization', 'Bearer ' + token);
-        res.status(200).json({ message: "User logged in successfully", userId: data._id, token: token })
+        res.status(200).json({})
     } catch (error) {
         console.log(error.message);
killedBy: Auth Controller login_post should log in the user with valid credentials
statusReason: expected false to be true
