[Killed] BlockStatement
controllers/userController.js:145:21
         })
         res.setHeader('Authorization', 'Bearer ' + token);
         res.status(200).json({ message: "User logged in successfully", userId: data._id, token: token })
-    } catch (error) {
-        console.log(error.message);
-        res.status(400).json({ message: error.message });
-    }
+    } catch (error) {}
 
 }
killedBy: Auth Controller login_post should handle database errors during login
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/userController.js:159:25
             host: 'smtp.gmail.com',
             port: 465,
             secure: true,
-            requireTLS: true,
+            requireTLS: false,
             auth: {
                 user: process.env.email,
killedBy: Auth Controller sendresetpasswordmail should handle email sending error with proper error check
statusReason: res is not defined

[Killed] ObjectLiteral
controllers/userController.js:160:19
             port: 465,
             secure: true,
             requireTLS: true,
-            auth: {
-                user: process.env.email,
-                pass: process.env.password
-            }
+            auth: {}
         });
 
killedBy: Auth Controller sendresetpasswordmail should handle email sending error with proper error check
statusReason: res is not defined

[Killed] StringLiteral
controllers/userController.js:169:22
         const mailOptions = {
             from: process.env.email,
             to: email,
-            subject: 'For reset password',
+            subject: "",
             html: ResetPasswordTemplate.replace("{Username}",name).replace("{url}",`${process.env.FRONTEND_URL}/auth/reset-password/${token}`)
 
killedBy: Auth Controller sendresetpasswordmail should include correct mail options
statusReason: res is not defined

[Killed] StringLiteral
controllers/userController.js:170:76
             from: process.env.email,
             to: email,
             subject: 'For reset password',
-            html: ResetPasswordTemplate.replace("{Username}",name).replace("{url}",`${process.env.FRONTEND_URL}/auth/reset-password/${token}`)
+            html: ResetPasswordTemplate.replace("{Username}",name).replace("",`${process.env.FRONTEND_URL}/auth/reset-password/${token}`)
 
         }
killedBy: Auth Controller sendresetpasswordmail should include correct mail options
statusReason: expected 'http://localhost:3000/auth/reset-pass…' to not include '{url}'

[Killed] BlockStatement
controllers/userController.js:174:66
 
         }
 
-        transporter.sendMail(mailOptions, function (error, info) {
-            if (error) {
-                console.log(error);
-            }
-            else {
-                console.log(`email send successfully ${info.response}`);
-            }
-        })
+        transporter.sendMail(mailOptions, function (error, info) {})
     } catch (err) {
         console.log(err);
killedBy: Auth Controller sendresetpasswordmail should handle email sending error with proper error check
statusReason: Cannot read properties of null (reading 'args')

[Killed] ConditionalExpression
controllers/userController.js:175:17
         }
 
         transporter.sendMail(mailOptions, function (error, info) {
-            if (error) {
+            if (true) {
                 console.log(error);
             }
killedBy: Auth Controller sendresetpasswordmail should properly log success message with response info
statusReason: the given combination of arguments (null and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
controllers/userController.js:175:17
         }
 
         transporter.sendMail(mailOptions, function (error, info) {
-            if (error) {
+            if (false) {
                 console.log(error);
             }
killedBy: Auth Controller sendresetpasswordmail should handle email sending error with proper error check
statusReason: res is not defined

[Killed] BlockStatement
controllers/userController.js:178:18
             if (error) {
                 console.log(error);
             }
-            else {
-                console.log(`email send successfully ${info.response}`);
-            }
+            else {}
         })
     } catch (err) {
killedBy: Auth Controller sendresetpasswordmail should properly log success message with response info
statusReason: Cannot read properties of null (reading 'args')

[Survived] BlockStatement
controllers/userController.js:182:19
                 console.log(`email send successfully ${info.response}`);
             }
         })
-    } catch (err) {
-        console.log(err);
-        const error_message = errorHandle(err); // Use the correct function name
-        res.status(401).json({ message: error_message });
-    }
+    } catch (err) {}
 }
 

[Killed] BlockStatement
controllers/userController.js:190:9
 }
 
 const forgotPassword = async (req, res) => {
-    try {
-        const { email , userType } = req.body;
-        const userdata = await usermodel.findOne({ email: email });
-
-        if (!userdata) {
-            return res.status(401).send({ message: "Enter valid registered Email Id" });
-        }
-        if(userdata.isOwner && userType === 'customer' || (!userdata.isOwner && userType === 'owner')) {
-            return res.status(401).json({message: "Unauthorized"})
-        }
-        let tokendata = await Token.findOne({ userid: userdata._id });
-        if (!tokendata) {
-            const rs = randomstring.generate();
-            tokendata = new Token({
-                userid: userdata._id,
-                token: rs
-            });
-            await tokendata.save();
-        }
-
-        sendresetpasswordmail(userdata.name, userdata.email, tokendata.token);
-        return res.status(200).send({ message: "Reset Password Link has been sent to your email" })
-
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
         res.status(401).json({ message: error.message });
killedBy: Auth Controller forgotPassword should return 401 when owner tries to use customer route
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/userController.js:192:50
 const forgotPassword = async (req, res) => {
     try {
         const { email , userType } = req.body;
-        const userdata = await usermodel.findOne({ email: email });
+        const userdata = await usermodel.findOne({});
 
         if (!userdata) {
killedBy: Auth Controller forgotPassword should return 401 when owner tries to use customer route
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:194:13
         const { email , userType } = req.body;
         const userdata = await usermodel.findOne({ email: email });
 
-        if (!userdata) {
+        if (false) {
             return res.status(401).send({ message: "Enter valid registered Email Id" });
         }
killedBy: Auth Controller forgotPassword should return 401 for unregistered email
statusReason: res.status(...).json is not a function

[Killed] BooleanLiteral
controllers/userController.js:194:13
         const { email , userType } = req.body;
         const userdata = await usermodel.findOne({ email: email });
 
-        if (!userdata) {
+        if (userdata) {
             return res.status(401).send({ message: "Enter valid registered Email Id" });
         }
killedBy: Auth Controller forgotPassword should return 401 when owner tries to use customer route
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/userController.js:195:41
         const userdata = await usermodel.findOne({ email: email });
 
         if (!userdata) {
-            return res.status(401).send({ message: "Enter valid registered Email Id" });
+            return res.status(401).send({});
         }
         if(userdata.isOwner && userType === 'customer' || (!userdata.isOwner && userType === 'owner')) {
killedBy: Auth Controller forgotPassword should return 401 for unregistered email
statusReason: expected false to be true

[Killed] StringLiteral
controllers/userController.js:195:52
         const userdata = await usermodel.findOne({ email: email });
 
         if (!userdata) {
-            return res.status(401).send({ message: "Enter valid registered Email Id" });
+            return res.status(401).send({ message: "" });
         }
         if(userdata.isOwner && userType === 'customer' || (!userdata.isOwner && userType === 'owner')) {
killedBy: Auth Controller forgotPassword should return 401 for unregistered email
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:197:60
         if (!userdata) {
             return res.status(401).send({ message: "Enter valid registered Email Id" });
         }
-        if(userdata.isOwner && userType === 'customer' || (!userdata.isOwner && userType === 'owner')) {
+        if(userdata.isOwner && userType === 'customer' || (false)) {
             return res.status(401).json({message: "Unauthorized"})
         }
killedBy: Auth Controller forgotPassword should return 401 when customer tries to use owner route

[Killed] ConditionalExpression
controllers/userController.js:197:81
         if (!userdata) {
             return res.status(401).send({ message: "Enter valid registered Email Id" });
         }
-        if(userdata.isOwner && userType === 'customer' || (!userdata.isOwner && userType === 'owner')) {
+        if(userdata.isOwner && userType === 'customer' || (!userdata.isOwner && true)) {
             return res.status(401).json({message: "Unauthorized"})
         }
killedBy: Auth Controller forgotPassword should handle error when creating new token
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/userController.js:201:13
             return res.status(401).json({message: "Unauthorized"})
         }
         let tokendata = await Token.findOne({ userid: userdata._id });
-        if (!tokendata) {
+        if (tokendata) {
             const rs = randomstring.generate();
             tokendata = new Token({
killedBy: Auth Controller forgotPassword should handle error when creating new token
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:201:13
             return res.status(401).json({message: "Unauthorized"})
         }
         let tokendata = await Token.findOne({ userid: userdata._id });
-        if (!tokendata) {
+        if (false) {
             const rs = randomstring.generate();
             tokendata = new Token({
killedBy: Auth Controller forgotPassword should handle error when creating new token
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:213:21
         sendresetpasswordmail(userdata.name, userdata.email, tokendata.token);
         return res.status(200).send({ message: "Reset Password Link has been sent to your email" })
 
-    } catch (error) {
-        console.log(error);
-        res.status(401).json({ message: error.message });
-    }
+    } catch (error) {}
 
 }
killedBy: Auth Controller forgotPassword should handle error when creating new token
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:221:9
 }
 
 const resetPassword = async (req, res) => {
-    try {
-        const token = req.params.token;
-        const tokendata = await Token.findOne({ token: token });
-        if (tokendata) {
-            const password = req.body.password;
-            if (!password) {
-                return res.status(401).send({ message: "Password is required" });
-            }
-            const user = await usermodel.findOne({ _id: tokendata.userid });
-            if (!user) {
-                return res.status(400).send({ message: "Cannot find user" });
-            }
-            user.password = password;
-            await user.save();
-            await tokendata.deleteOne({ token: token })
-            return res.status(200).send({ message: "Password changed successfully" });
-        }
-        else {
-            return res.status(404).send({ message: "Invalid Token" });
-        }
-
-    } catch (error) {
+    try {} catch (error) {
         console.log(error);
         res.status(401).json({ message: error.message });
killedBy: Auth Controller resetPassword should reset the password for a valid token
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:224:13
     try {
         const token = req.params.token;
         const tokendata = await Token.findOne({ token: token });
-        if (tokendata) {
+        if (true) {
             const password = req.body.password;
             if (!password) {
killedBy: Auth Controller resetPassword should return 404 for invalid token
statusReason: res.status(...).json is not a function

[Killed] BlockStatement
controllers/userController.js:224:24
     try {
         const token = req.params.token;
         const tokendata = await Token.findOne({ token: token });
-        if (tokendata) {
-            const password = req.body.password;
-            if (!password) {
-                return res.status(401).send({ message: "Password is required" });
-            }
-            const user = await usermodel.findOne({ _id: tokendata.userid });
-            if (!user) {
-                return res.status(400).send({ message: "Cannot find user" });
-            }
-            user.password = password;
-            await user.save();
-            await tokendata.deleteOne({ token: token })
-            return res.status(200).send({ message: "Password changed successfully" });
-        }
+        if (tokendata) {}
         else {
             return res.status(404).send({ message: "Invalid Token" });
killedBy: Auth Controller resetPassword should reset the password for a valid token
statusReason: expected false to be true

[Killed] ConditionalExpression
controllers/userController.js:226:17
         const tokendata = await Token.findOne({ token: token });
         if (tokendata) {
             const password = req.body.password;
-            if (!password) {
+            if (true) {
                 return res.status(401).send({ message: "Password is required" });
             }
killedBy: Auth Controller resetPassword should reset the password for a valid token
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:226:28
         const tokendata = await Token.findOne({ token: token });
         if (tokendata) {
             const password = req.body.password;
-            if (!password) {
-                return res.status(401).send({ message: "Password is required" });
-            }
+            if (!password) {}
             const user = await usermodel.findOne({ _id: tokendata.userid });
             if (!user) {
killedBy: Auth Controller resetPassword should return 401 when no password provided
statusReason: expected false to be true

[Survived] ObjectLiteral
controllers/userController.js:229:50
             if (!password) {
                 return res.status(401).send({ message: "Password is required" });
             }
-            const user = await usermodel.findOne({ _id: tokendata.userid });
+            const user = await usermodel.findOne({});
             if (!user) {
                 return res.status(400).send({ message: "Cannot find user" });

[Killed] ConditionalExpression
controllers/userController.js:230:17
                 return res.status(401).send({ message: "Password is required" });
             }
             const user = await usermodel.findOne({ _id: tokendata.userid });
-            if (!user) {
+            if (false) {
                 return res.status(400).send({ message: "Cannot find user" });
             }
killedBy: Auth Controller resetPassword should return 400 when user not found
statusReason: expected false to be true

[Killed] BooleanLiteral
controllers/userController.js:230:17
                 return res.status(401).send({ message: "Password is required" });
             }
             const user = await usermodel.findOne({ _id: tokendata.userid });
-            if (!user) {
+            if (user) {
                 return res.status(400).send({ message: "Cannot find user" });
             }
killedBy: Auth Controller resetPassword should reset the password for a valid token
statusReason: expected false to be true

[Killed] BlockStatement
controllers/userController.js:238:14
             await tokendata.deleteOne({ token: token })
             return res.status(200).send({ message: "Password changed successfully" });
         }
-        else {
-            return res.status(404).send({ message: "Invalid Token" });
-        }
+        else {}
 
     } catch (error) {
killedBy: Auth Controller resetPassword should return 404 for invalid token
statusReason: expected false to be true

[Killed] StringLiteral
controllers/userController.js:239:52
             return res.status(200).send({ message: "Password changed successfully" });
         }
         else {
-            return res.status(404).send({ message: "Invalid Token" });
+            return res.status(404).send({ message: "" });
         }
 
killedBy: Auth Controller resetPassword should return 404 for invalid token
statusReason: expected false to be true

[Killed] ObjectLiteral
controllers/userController.js:248:18
     }
 }
 
-module.exports = { isDomainValid, signup_post, login_post, forgotPassword, resetPassword, confirmEmail, sendresetpasswordmail, sendConfirmationEmail, errorHandle };
+module.exports = {};
 
killedBy: Auth Controller signup_post should return 409 if user already exists
statusReason: signup_post is not a function
